tap "adoptopenjdk/openjdk"
tap "anthonyagresta/openssh"
tap "hashicorp/tap"
tap "helix-editor/helix"
tap "hhvm/hhvm"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "puma/puma"
tap "qmk/qmk"
tap "reviewdog/tap"
brew "jpeg-xl"
brew "aom"
brew "coreutils"
brew "asdf"
brew "atuin"
brew "awscli"
brew "bat"
brew "glib"
brew "python@3.9"
brew "certbot"
brew "cmake"
brew "diff-so-fancy"
brew "dnsmasq"
brew "docker", link: false
brew "snappy"
brew "folly"
brew "exa"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "openjpeg"
brew "git"
brew "git-lfs"
brew "git-recent"
brew "gnutls"
brew "gnupg"
brew "grep"
brew "helix"
brew "httpie"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "ldns"
brew "libfido2"
brew "memcached", restart_service: true
brew "mysql@5.7", restart_service: true
brew "neovim"
brew "neovim-remote"
brew "nghttp2"
brew "nginx", restart_service: true
brew "node"
brew "passenger"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "starship", link: false
brew "swiftlint"
brew "task"
brew "tfenv"
brew "tmux"
brew "tmuxinator"
brew "v8"
brew "watchman"
brew "wireshark"
brew "zig"
brew "anthonyagresta/openssh/openssh@8.7"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/vault"
brew "qmk/qmk/qmk"
brew "reviewdog/tap/reviewdog"
cask "adoptopenjdk8"
cask "db-browser-for-sqlite"
cask "fig"
cask "flipper"
cask "font-sauce-code-pro-nerd-font"
cask "keybase"
cask "raycast"
